forces = zeros(51,6);

for i=0:50 
    % 时间,每个0.1s计算一次
    t=i/10;

    % 输入位置
    q = [
        0.1 + 0.1*sin(t)
        0.2 + 0.2*sin(2*t)
        0.3 + 0.3*sin(3*t)
        0.4 + 0.4*sin(4*t)
        0.5 + 0.5*sin(5*t)
        0.6 + 0.6*sin(6*t)];
    % 输入速度，是q的导数
    dq = [
        0.1*cos(t)
        0.2*2*cos(2*t)
        0.3*3*cos(3*t)
        0.4*4*cos(4*t)
        0.5*5*cos(5*t)
        0.6*6*cos(6*t)];
    % 输入加速度
    ddq = [
        -0.1*sin(t)
        -0.2*2*2*sin(2*t)
        -0.3*3*3*sin(3*t)
        -0.4*4*4*sin(4*t)
        -0.5*5*5*sin(5*t)
        -0.6*6*6*sin(6*t)];
    
    % 计算
    ur5;
    
    % 上述脚本将结果保存在了工作区的变量中，现在取出这个变量
    forces(i+1,:) = actuation_force;
end

forces

